package ch04;
/*
 * 날짜 : 2022/01/04
 * 이름 : 장현민
 * 내용 : 자바 메서드 실행순서와 스택 실습 p159
 */

public class sub5_MethodStackTest {
	int num = 1;
	//전역변수(멤버 변수) :클래서에서 선언한 변수////////////////////////////////////////////
	public static void main(String[] args) {
///////////////////////////////////////////////////////////////////////////////////////		
	
		//지역 변수 : 메서드에서 선언한 변수, 메인에서만 사용됨.
		int result = 0;
	    int n1 = 1;
	    int n2 = 10;
	
	
	result = sum(n1, n2);
	System.out.println("결과 :" +result);
	
	
	
	
	
	
	
	
	
	
///////////////////////////////////////////////////////////////////////////////////////////////////////	
	}
	public static int sum(int start, int end ) {
		
		int total = 0;
		
		for (int k=start ; k<=end ; k++) {
			total +=k;
		}
		
		return total;
	}
	
	
	
///////////////////////////////////////////////////////////////////////
}
